src/Catalogs/ItobГеографическиеКарты/ItobГеографическиеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ItobГеографическиеКарты</name>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Правообладатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СайтПравообладателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Атрибуты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СлойПодложки</name>
    <type>
      <types>CatalogRef.ItobГеографическиеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сортировка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СекцияHEAD</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НестандартнаяПроекция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ItobГеографическиеКарты/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Сортировка = 100;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПустаяСтрока(Объект.Идентификатор) Тогда
		ItobРаботаС_БСП_КлиентСервер.СообщитьПользователю(
						НСтр("ru = 'Не указан идентификатор!'"), ,
						"Объект.Идентификатор", ,
						Отказ);
		Возврат;				
						
	ИначеЕсли Найти(Объект.Идентификатор," ")>0 
			ИЛИ Найти(Объект.Идентификатор,"\")>0
			ИЛИ Найти(Объект.Идентификатор,"/")>0 Тогда
		ItobРаботаС_БСП_КлиентСервер.СообщитьПользователю(
						НСтр("ru = 'Неверный идентификатор!'"), ,
						"Объект.Идентификатор", ,
						Отказ);					
	    Возврат;
		
	КонецЕсли;                          
	
	Если НЕ Объект.СлойПодложки.Пустая()
		 И Объект.СлойПодложки = Объект.Ссылка Тогда		
		 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недопустимая настройка: указана подложка, совпадающая с самой географической картой",,,
														  "Объект.СлойПодложки",
														  Отказ);
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти
